In [1]:
%pylab inline
import pandas as pd
from pandas import Series, DataFrame

Populating the interactive namespace from numpy and matplotlib

In [2]:
# anything starting with % in Jupyter is a "magic command"
# you can get a full list with %magic

%ls *.csv

burrito_current.csv	   languages.csv  mydata.csv  titanic3.csv
celebrity_deaths_2016.csv  mydat.csv	  taxi.csv

In [3]:
df = pd.read_csv('titanic3.csv')

In [4]:
# files.lerner.co.il

In [5]:
df.head()

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
0,1.0,1.0,"Allen, Miss. Elisabeth Walton",female,29.0000,0.0,0.0,24160,211.3375,B5,S,2,NaN,"St Louis, MO"
1,1.0,1.0,"Allison, Master. Hudson Trevor",male,0.9167,1.0,2.0,113781,151.5500,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON"
2,1.0,0.0,"Allison, Miss. Helen Loraine",female,2.0000,1.0,2.0,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
3,1.0,0.0,"Allison, Mr. Hudson Joshua Creighton",male,30.0000,1.0,2.0,113781,151.5500,C22 C26,S,NaN,135.0,"Montreal, PQ / Chesterville, ON"
4,1.0,0.0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.0000,1.0,2.0,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"

In [6]:
# we could also say:

# df = DataFrame(np.random.randint(0, 100, 25).reshape(5,5),
#               index=list('abcde'),
#               columns=list('vwxyz'))


df = DataFrame(np.random.randint(0, 100, [5,5]),
              index=list('abcde'),
              columns=list('vwxyz'))
df

    v   w   x   y   z
a  34  69  21  99  54
b  91  74  29  28  44
c  23  40  81  63  75
d  88  98  55  19   0
e  88  20  89  19  97

In [7]:
df.columns

Index(['v', 'w', 'x', 'y', 'z'], dtype='object')

In [8]:
df.columns = 'userid w x y z'.split()
df

   userid   w   x   y   z
a      34  69  21  99  54
b      91  74  29  28  44
c      23  40  81  63  75
d      88  98  55  19   0
e      88  20  89  19  97

In [10]:
df[df['userid'] == 91]

   userid   w   x   y   z
b      91  74  29  28  44

In [11]:
df.set_index('userid')

         w   x   y   z
userid
34      69  21  99  54
91      74  29  28  44
23      40  81  63  75
88      98  55  19   0
88      20  89  19  97

In [12]:
df

   userid   w   x   y   z
a      34  69  21  99  54
b      91  74  29  28  44
c      23  40  81  63  75
d      88  98  55  19   0
e      88  20  89  19  97

In [13]:
df = df.set_index('userid')
df

         w   x   y   z
userid
34      69  21  99  54
91      74  29  28  44
23      40  81  63  75
88      98  55  19   0
88      20  89  19  97

In [14]:
df.loc[91]

w    74
x    29
y    28
z    44
Name: 91, dtype: int64

In [15]:
df.loc[88]

         w   x   y   z
userid
88      98  55  19   0
88      20  89  19  97

In [16]:
df.index

Int64Index([34, 91, 23, 88, 88], dtype='int64', name='userid')

In [17]:
df.index.name

'userid'

In [18]:
df.index.name = 'uid'

In [19]:
df

      w   x   y   z
uid
34   69  21  99  54
91   74  29  28  44
23   40  81  63  75
88   98  55  19   0
88   20  89  19  97

In [20]:
df['uid']

KeyError: 'uid'

In [21]:
df.reset_index()

   uid   w   x   y   z
0   34  69  21  99  54
1   91  74  29  28  44
2   23  40  81  63  75
3   88  98  55  19   0
4   88  20  89  19  97

In [22]:
df

      w   x   y   z
uid
34   69  21  99  54
91   74  29  28  44
23   40  81  63  75
88   98  55  19   0
88   20  89  19  97

In [23]:
df = df.reset_index()
df.index = list('abcde')
df

   uid   w   x   y   z
a   34  69  21  99  54
b   91  74  29  28  44
c   23  40  81  63  75
d   88  98  55  19   0
e   88  20  89  19  97

In [24]:
df.columns

Index(['uid', 'w', 'x', 'y', 'z'], dtype='object')

In [26]:
df.columns[2] = 'hahaha'

TypeError: Index does not support mutable operations

In [27]:
df.index

Index(['a', 'b', 'c', 'd', 'e'], dtype='object')

In [28]:
df.index = 'a b hahaha d e'.split()

In [29]:
df.index

Index(['a', 'b', 'hahaha', 'd', 'e'], dtype='object')

In [30]:
df.columns

Index(['uid', 'w', 'x', 'y', 'z'], dtype='object')

In [31]:
df = pd.read_csv('titanic3.csv')
df.head()

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
0,1.0,1.0,"Allen, Miss. Elisabeth Walton",female,29.0000,0.0,0.0,24160,211.3375,B5,S,2,NaN,"St Louis, MO"
1,1.0,1.0,"Allison, Master. Hudson Trevor",male,0.9167,1.0,2.0,113781,151.5500,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON"
2,1.0,0.0,"Allison, Miss. Helen Loraine",female,2.0000,1.0,2.0,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
3,1.0,0.0,"Allison, Mr. Hudson Joshua Creighton",male,30.0000,1.0,2.0,113781,151.5500,C22 C26,S,NaN,135.0,"Montreal, PQ / Chesterville, ON"
4,1.0,0.0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.0000,1.0,2.0,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"

In [32]:
df = df.set_index('ticket')
df.head()

,pclass,survived,name,sex,age,sibsp,parch,fare,cabin,embarked,boat,body,home.dest
ticket,,,,,,,,,,,,,
24160,1.0,1.0,"Allen, Miss. Elisabeth Walton",female,29.0000,0.0,0.0,211.3375,B5,S,2,NaN,"St Louis, MO"
113781,1.0,1.0,"Allison, Master. Hudson Trevor",male,0.9167,1.0,2.0,151.5500,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON"
113781,1.0,0.0,"Allison, Miss. Helen Loraine",female,2.0000,1.0,2.0,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
113781,1.0,0.0,"Allison, Mr. Hudson Joshua Creighton",male,30.0000,1.0,2.0,151.5500,C22 C26,S,NaN,135.0,"Montreal, PQ / Chesterville, ON"
113781,1.0,0.0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.0000,1.0,2.0,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"

In [34]:
df.loc['113781']

,pclass,survived,name,sex,age,sibsp,parch,fare,cabin,embarked,boat,body,home.dest
ticket,,,,,,,,,,,,,
113781,1.0,1.0,"Allison, Master. Hudson Trevor",male,0.9167,1.0,2.0,151.55,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON"
113781,1.0,0.0,"Allison, Miss. Helen Loraine",female,2.0000,1.0,2.0,151.55,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
113781,1.0,0.0,"Allison, Mr. Hudson Joshua Creighton",male,30.0000,1.0,2.0,151.55,C22 C26,S,NaN,135.0,"Montreal, PQ / Chesterville, ON"
113781,1.0,0.0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.0000,1.0,2.0,151.55,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
113781,1.0,1.0,"Cleaver, Miss. Alice",female,22.0000,0.0,0.0,151.55,NaN,S,11,NaN,NaN
113781,1.0,1.0,"Daniels, Miss. Sarah",female,33.0000,0.0,0.0,151.55,NaN,S,8,NaN,NaN

In [36]:
df.loc['113780':'113800']

,pclass,survived,name,sex,age,sibsp,parch,fare,cabin,embarked,boat,body,home.dest
ticket,,,,,,,,,,,,,
113780,1.0,1.0,"Gracie, Col. Archibald IV",male,53.0,0.0,0.0,28.5000,C51,C,B,NaN,"Washington, DC"
112053,1.0,1.0,"Graham, Miss. Margaret Edith",female,19.0,0.0,0.0,30.0000,B42,S,3,NaN,"Greenwich, CT"
PC 17582,1.0,0.0,"Graham, Mr. George Edward",male,38.0,0.0,1.0,153.4625,C91,S,NaN,147.0,"Winnipeg, MB"
PC 17582,1.0,1.0,"Graham, Mrs. William Thompson (Edith Junkins)",female,58.0,0.0,1.0,153.4625,C125,S,3,NaN,"Greenwich, CT"
PC 17759,1.0,1.0,"Greenfield, Mr. William Bertram",male,23.0,0.0,1.0,63.3583,D10 D12,C,7,NaN,"New York, NY"
...,...,...,...,...,...,...,...,...,...,...,...,...,...
36967,1.0,0.0,"Walker, Mr. William Anderson",male,47.0,0.0,0.0,34.0208,D46,S,NaN,NaN,"East Orange, NJ"
PC 17755,1.0,1.0,"Ward, Miss. Anna",female,35.0,0.0,0.0,512.3292,NaN,C,3,NaN,NaN
110813,1.0,0.0,"Warren, Mr. Frank Manley",male,64.0,1.0,0.0,75.2500,D37,C,NaN,NaN,"Portland, OR"
110813,1.0,1.0,"Warren, Mrs. Frank Manley (Anna Sophia Atkinson)",female,60.0,1.0,0.0,75.2500,D37,C,5,NaN,"Portland, OR"
113800,1.0,0.0,"Weir, Col. John",male,60.0,0.0,0.0,26.5500,NaN,S,NaN,NaN,"England Salt Lake City, Utah"

In [37]:
df = df.reset_index()
df = df.set_index('sex')
df

,ticket,pclass,survived,name,age,sibsp,parch,fare,cabin,embarked,boat,body,home.dest
sex,,,,,,,,,,,,,
female,24160,1.0,1.0,"Allen, Miss. Elisabeth Walton",29.0000,0.0,0.0,211.3375,B5,S,2,NaN,"St Louis, MO"
male,113781,1.0,1.0,"Allison, Master. Hudson Trevor",0.9167,1.0,2.0,151.5500,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON"
female,113781,1.0,0.0,"Allison, Miss. Helen Loraine",2.0000,1.0,2.0,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
male,113781,1.0,0.0,"Allison, Mr. Hudson Joshua Creighton",30.0000,1.0,2.0,151.5500,C22 C26,S,NaN,135.0,"Montreal, PQ / Chesterville, ON"
female,113781,1.0,0.0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",25.0000,1.0,2.0,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
...,...,...,...,...,...,...,...,...,...,...,...,...,...
female,2665,3.0,0.0,"Zabour, Miss. Thamine",NaN,1.0,0.0,14.4542,NaN,C,NaN,NaN,NaN
male,2656,3.0,0.0,"Zakarian, Mr. Mapriededer",26.5000,0.0,0.0,7.2250,NaN,C,NaN,304.0,NaN
male,2670,3.0,0.0,"Zakarian, Mr. Ortin",27.0000,0.0,0.0,7.2250,NaN,C,NaN,NaN,NaN
male,315082,3.0,0.0,"Zimmerman, Mr. Leo",29.0000,0.0,0.0,7.8750,NaN,S,NaN,NaN,NaN
NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [39]:
df.loc['female']

,ticket,pclass,survived,name,age,sibsp,parch,fare,cabin,embarked,boat,body,home.dest
sex,,,,,,,,,,,,,
female,24160,1.0,1.0,"Allen, Miss. Elisabeth Walton",29.0,0.0,0.0,211.3375,B5,S,2,NaN,"St Louis, MO"
female,113781,1.0,0.0,"Allison, Miss. Helen Loraine",2.0,1.0,2.0,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
female,113781,1.0,0.0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",25.0,1.0,2.0,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
female,13502,1.0,1.0,"Andrews, Miss. Kornelia Theodosia",63.0,1.0,0.0,77.9583,D7,S,10,NaN,"Hudson, NY"
female,11769,1.0,1.0,"Appleton, Mrs. Edward Dale (Charlotte Lamson)",53.0,2.0,0.0,51.4792,C101,S,D,NaN,"Bayside, Queens, NY"
...,...,...,...,...,...,...,...,...,...,...,...,...,...
female,2688,3.0,1.0,"Whabee, Mrs. George Joseph (Shawneene Abi-Saab)",38.0,0.0,0.0,7.2292,NaN,C,C,NaN,NaN
female,363272,3.0,1.0,"Wilkes, Mrs. James (Ellen Needs)",47.0,1.0,0.0,7.0000,NaN,S,NaN,NaN,NaN
female,2659,3.0,1.0,"Yasbeck, Mrs. Antoni (Selini Alexander)",15.0,1.0,0.0,14.4542,NaN,C,NaN,NaN,NaN
female,2665,3.0,0.0,"Zabour, Miss. Hileni",14.5,1.0,0.0,14.4542,NaN,C,NaN,328.0,NaN
female,2665,3.0,0.0,"Zabour, Miss. Thamine",NaN,1.0,0.0,14.4542,NaN,C,NaN,NaN,NaN

In [40]:
# time series ...

In [41]:
df = pd.read_csv('taxi.csv',
                usecols=['tpep_pickup_datetime',
                         'tpep_dropoff_datetime',
                        'trip_distance',
                        'passenger_count', 
                        'total_amount'])

df.head()

,tpep_pickup_datetime,tpep_dropoff_datetime,passenger_count,trip_distance,total_amount
0,2015-06-02 11:19:29,2015-06-02 11:47:52,1,1.63,17.80
1,2015-06-02 11:19:30,2015-06-02 11:27:56,1,0.46,8.30
2,2015-06-02 11:19:31,2015-06-02 11:30:30,1,0.87,11.00
3,2015-06-02 11:19:31,2015-06-02 11:39:02,1,2.13,17.16
4,2015-06-02 11:19:32,2015-06-02 11:32:49,1,1.40,10.30

In [42]:
# point in time, or a "timestamp" -- absolute, with 
#   a specified YMD, HMS, etc.

# timedelta or a time range or an interval -- relative,
#   taking a certain amount of time, but not fixed
#   any any point absolutely

# "Your project will be ready at 10 a.m. on Friday " -- timestamp
# "Your project will be ready 3 days after I start" -- timedelta

In [43]:
# timestamp - timestamp -> timedelta
# timestamp + timedelta -> timestamp

In [44]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9999 entries, 0 to 9998
Data columns (total 5 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   tpep_pickup_datetime   9999 non-null   object
 1   tpep_dropoff_datetime  9999 non-null   object
 2   passenger_count        9999 non-null   int64
 3   trip_distance          9999 non-null   float64
 4   total_amount           9999 non-null   float64
dtypes: float64(2), int64(1), object(2)
memory usage: 390.7+ KB

In [45]:
df.head()

,tpep_pickup_datetime,tpep_dropoff_datetime,passenger_count,trip_distance,total_amount
0,2015-06-02 11:19:29,2015-06-02 11:47:52,1,1.63,17.80
1,2015-06-02 11:19:30,2015-06-02 11:27:56,1,0.46,8.30
2,2015-06-02 11:19:31,2015-06-02 11:30:30,1,0.87,11.00
3,2015-06-02 11:19:31,2015-06-02 11:39:02,1,2.13,17.16
4,2015-06-02 11:19:32,2015-06-02 11:32:49,1,1.40,10.30

In [46]:
df = pd.read_csv('taxi.csv',
                usecols=['tpep_pickup_datetime',
                         'tpep_dropoff_datetime',
                        'trip_distance',
                        'passenger_count', 
                        'total_amount'],
                parse_dates=['tpep_pickup_datetime',
                            'tpep_dropoff_datetime'])

df.head()

,tpep_pickup_datetime,tpep_dropoff_datetime,passenger_count,trip_distance,total_amount
0,2015-06-02 11:19:29,2015-06-02 11:47:52,1,1.63,17.80
1,2015-06-02 11:19:30,2015-06-02 11:27:56,1,0.46,8.30
2,2015-06-02 11:19:31,2015-06-02 11:30:30,1,0.87,11.00
3,2015-06-02 11:19:31,2015-06-02 11:39:02,1,2.13,17.16
4,2015-06-02 11:19:32,2015-06-02 11:32:49,1,1.40,10.30

In [47]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9999 entries, 0 to 9998
Data columns (total 5 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   tpep_pickup_datetime   9999 non-null   datetime64[ns]
 1   tpep_dropoff_datetime  9999 non-null   datetime64[ns]
 2   passenger_count        9999 non-null   int64
 3   trip_distance          9999 non-null   float64
 4   total_amount           9999 non-null   float64
dtypes: datetime64[ns](2), float64(2), int64(1)
memory usage: 390.7 KB

In [48]:
df.head()

,tpep_pickup_datetime,tpep_dropoff_datetime,passenger_count,trip_distance,total_amount
0,2015-06-02 11:19:29,2015-06-02 11:47:52,1,1.63,17.80
1,2015-06-02 11:19:30,2015-06-02 11:27:56,1,0.46,8.30
2,2015-06-02 11:19:31,2015-06-02 11:30:30,1,0.87,11.00
3,2015-06-02 11:19:31,2015-06-02 11:39:02,1,2.13,17.16
4,2015-06-02 11:19:32,2015-06-02 11:32:49,1,1.40,10.30

In [50]:
# what was the average price of a taxi ride that 
# took more than 30 minutes?

df['trip_time'] = df['tpep_dropoff_datetime'] - df['tpep_pickup_datetime']

In [51]:
df.head()

,tpep_pickup_datetime,tpep_dropoff_datetime,passenger_count,trip_distance,total_amount,trip_time
0,2015-06-02 11:19:29,2015-06-02 11:47:52,1,1.63,17.80,00:28:23
1,2015-06-02 11:19:30,2015-06-02 11:27:56,1,0.46,8.30,00:08:26
2,2015-06-02 11:19:31,2015-06-02 11:30:30,1,0.87,11.00,00:10:59
3,2015-06-02 11:19:31,2015-06-02 11:39:02,1,2.13,17.16,00:19:31
4,2015-06-02 11:19:32,2015-06-02 11:32:49,1,1.40,10.30,00:13:17

In [53]:
df[df['trip_time'] > '00:30:00']

,tpep_pickup_datetime,tpep_dropoff_datetime,passenger_count,trip_distance,total_amount,trip_time
7,2015-06-02 11:19:35,2015-06-02 12:36:46,4,11.90,73.84,01:17:11
24,2015-06-02 11:19:52,2015-06-02 11:53:51,1,3.80,26.75,00:33:59
43,2015-06-02 11:20:05,2015-06-02 12:02:22,2,5.30,33.35,00:42:17
50,2015-06-02 11:20:08,2015-06-02 11:56:30,2,4.00,30.94,00:36:22
57,2015-06-02 11:20:14,2015-06-02 11:52:12,1,3.15,27.25,00:31:58
...,...,...,...,...,...,...
9897,2015-06-01 00:13:21,2015-06-01 00:51:55,6,16.11,62.14,00:38:34
9900,2015-06-01 00:13:25,2015-06-01 00:45:22,1,8.16,35.76,00:31:57
9944,2015-06-01 00:13:29,2015-06-01 00:48:37,1,11.40,42.80,00:35:08
9964,2015-06-01 00:13:10,2015-06-01 00:43:19,1,18.55,58.34,00:30:09
9980,2015-06-01 00:13:29,2015-06-01 00:44:44,1,9.13,31.30,00:31:15

In [55]:
# (1) (more or less) copy what I did, reading the taxi data into
#     Pandas, parsing the two datetime columns as timestamps.

df = pd.read_csv('taxi.csv', 
                usecols=['tpep_pickup_datetime',
                        'tpep_dropoff_datetime',
                        'passenger_count',
                        'trip_distance',
                        'total_amount'],
                parse_dates=['tpep_pickup_datetime',
                            'tpep_dropoff_datetime'])
df.head()

,tpep_pickup_datetime,tpep_dropoff_datetime,passenger_count,trip_distance,total_amount
0,2015-06-02 11:19:29,2015-06-02 11:47:52,1,1.63,17.80
1,2015-06-02 11:19:30,2015-06-02 11:27:56,1,0.46,8.30
2,2015-06-02 11:19:31,2015-06-02 11:30:30,1,0.87,11.00
3,2015-06-02 11:19:31,2015-06-02 11:39:02,1,2.13,17.16
4,2015-06-02 11:19:32,2015-06-02 11:32:49,1,1.40,10.30

In [57]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9999 entries, 0 to 9998
Data columns (total 5 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   tpep_pickup_datetime   9999 non-null   datetime64[ns]
 1   tpep_dropoff_datetime  9999 non-null   datetime64[ns]
 2   passenger_count        9999 non-null   int64
 3   trip_distance          9999 non-null   float64
 4   total_amount           9999 non-null   float64
dtypes: datetime64[ns](2), float64(2), int64(1)
memory usage: 390.7 KB

In [58]:
df['trip_time'] = df['tpep_dropoff_datetime'] - df['tpep_pickup_datetime']
df.head()

,tpep_pickup_datetime,tpep_dropoff_datetime,passenger_count,trip_distance,total_amount,trip_time
0,2015-06-02 11:19:29,2015-06-02 11:47:52,1,1.63,17.80,00:28:23
1,2015-06-02 11:19:30,2015-06-02 11:27:56,1,0.46,8.30,00:08:26
2,2015-06-02 11:19:31,2015-06-02 11:30:30,1,0.87,11.00,00:10:59
3,2015-06-02 11:19:31,2015-06-02 11:39:02,1,2.13,17.16,00:19:31
4,2015-06-02 11:19:32,2015-06-02 11:32:49,1,1.40,10.30,00:13:17

In [59]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9999 entries, 0 to 9998
Data columns (total 6 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   tpep_pickup_datetime   9999 non-null   datetime64[ns]
 1   tpep_dropoff_datetime  9999 non-null   datetime64[ns]
 2   passenger_count        9999 non-null   int64
 3   trip_distance          9999 non-null   float64
 4   total_amount           9999 non-null   float64
 5   trip_time              9999 non-null   timedelta64[ns]
dtypes: datetime64[ns](2), float64(2), int64(1), timedelta64[ns](1)
memory usage: 468.8 KB

In [63]:
# (2) What was the average fare for trips > 60 minutes?

df['total_amount'][df['trip_time'] > '00:60:00'].mean()

62.57652941176472

In [65]:
# (3) What was the distribution of passenger count for trips
    # < 10 minutes?  How many <10 min trips were there, anyway?
    
df[df['trip_time'] < '00:10:00'].describe()

,tpep_pickup_datetime,tpep_dropoff_datetime,passenger_count,trip_distance,total_amount,trip_time
1,2015-06-02 11:19:30,2015-06-02 11:27:56,1,0.46,8.30,00:08:26
5,2015-06-02 11:19:33,2015-06-02 11:28:48,1,1.40,10.55,00:09:15
9,2015-06-02 11:19:38,2015-06-02 11:23:50,1,0.60,6.30,00:04:12
10,2015-06-02 11:19:38,2015-06-02 11:19:43,3,0.01,52.80,00:00:05
13,2015-06-02 11:19:41,2015-06-02 11:23:56,2,0.50,6.60,00:04:15
...,...,...,...,...,...,...
9987,2015-06-01 00:13:36,2015-06-01 00:19:18,1,1.40,8.30,00:05:42
9988,2015-06-01 00:13:39,2015-06-01 00:18:22,1,0.90,8.50,00:04:43
9989,2015-06-01 00:13:41,2015-06-01 00:17:44,6,1.34,8.76,00:04:03
9991,2015-06-01 00:13:43,2015-06-01 00:21:49,1,1.48,9.30,00:08:06
9997,2015-06-01 00:13:02,2015-06-01 00:19:10,6,1.54,7.80,00:06:08